Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20b/atdf/ATSAMD20E15B.atdf
        <module name="FUSES" id="U2207" version="1.0.9">
          <instance name="FUSES">
            <register-group name="OTP4_FUSES" name-in-module="OTP4_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806030"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="PAC" id="U2211" version="1.0.1">
          <instance name="PAC0">
            <register-group name="PAC0" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000000"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
          <instance name="PAC1">
            <register-group name="PAC1" name-in-module="PAC" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000002"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
          <instance name="PAC2">
            <register-group name="PAC2" name-in-module="PAC" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00100000"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2206" version="2.0.2">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="CTRL_MCSEL_DFLL48M" value="3"/>
              <param name="CTRL_MCSEL_GCLK" value="0"/>
              <param name="CTRL_MCSEL_OSC8M" value="1"/>
              <param name="CTRL_MCSEL_XOSC" value="2"/>
              <param name="PM_CLK_APB_NUM" value="2"/>
              <param name="SYSTEM_CLOCK" value="1000000"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="NVMCTRL" bit="4"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="1.0.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41004400"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="BITS" value="64"/>
              <param name="DRVSTR" value="1"/>
              <param name="GROUPS" value="1"/>
              <param name="ODRAIN" value="0"/>
              <param name="SLEWLIM" value="0"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="1.0.2.1">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42004C00"/>
            <signals>
              <signal group="X" index="0" function="B_PTC" pad="PA08"/>
              <signal group="X" index="1" function="B_PTC" pad="PA09"/>
              <signal group="X" index="2" function="B_PTC" pad="PA10"/>
              <signal group="X" index="3" function="B_PTC" pad="PA11"/>
              <signal group="X" index="4" function="B_PTC" pad="PA16"/>
              <signal group="X" index="5" function="B_PTC" pad="PA17"/>
              <signal group="X" index="6" function="B_PTC" pad="PA18"/>
              <signal group="X" index="7" function="B_PTC" pad="PA19"/>
              <signal group="X" index="10" function="B_PTC" pad="PA22"/>
              <signal group="X" index="11" function="B_PTC" pad="PA23"/>
              <signal group="Y" index="0" function="B_PTC" pad="PA02"/>
              <signal group="Y" index="1" function="B_PTC" pad="PA03"/>
              <signal group="Y" index="2" function="B_PTC" pad="PA04"/>
              <signal group="Y" index="3" function="B_PTC" pad="PA05"/>
              <signal group="Y" index="4" function="B_PTC" pad="PA06"/>
              <signal group="Y" index="5" function="B_PTC" pad="PA07"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="27"/>
              <param name="INSTANCE_ID" value="83"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GCLK_ID" value="2"/>
              <param name="NUM_OF_ALARMS" value="1"/>
              <param name="NUM_OF_COMP16" value="2"/>
              <param name="NUM_OF_COMP32" value="1"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
